
// Переменные, константы, литералы

// Переменная представляет именнованную область памяти, в которой хранится значение определенного типа.
// Переменная имеет тип, имя и значение. Тип определяет, какого рода информацию может хранить переменная.
string name = "Dima";
Console.WriteLine(name + "\n"); // Вывод в консоль

// Константа должна быть обязательно инициализирована при определении, и после определения значение константы не может быть изменено
const string name_2 = "Леопольд";
Console.WriteLine(name_2 + "\n");

//Литералы представляют неизменяемые значения (иногда их еще называют константами).
//Литералы можно передавать переменным в качестве значения.
//Литералы бывают логическими, целочисленными, вещественными, символьными и строчными.
//И отдельный литерал представляет ключевое слово null.

Console.WriteLine(true + "\n");
Console.WriteLine(-11 + "\n");
Console.WriteLine(0x0A + "\n");

// И т.д.